content/man/man1/git-whatchanged.1.org
#+TITLE: Manpages - git-whatchanged.1
* NAME
git-whatchanged - Show logs with differences each commit introduces

* SYNOPSIS
#+begin_example
git whatchanged <option>...
#+end_example

* DESCRIPTION
Shows commit logs and diff output each commit introduces.

New users are encouraged to use *git-log*(1) instead. The *whatchanged*
command is essentially the same as *git-log*(1) but defaults to showing
the raw format diff output and skipping merges.

The command is primarily kept for historical reasons; fingers of many
people who learned Git long before *git log* was invented by reading the
Linux kernel mailing list are trained to type it.

* EXAMPLES
*git whatchanged -p v2.6.12.. include/scsi drivers/scsi*

#+begin_quote
Show as patches the commits since version /v2.6.12/ that changed any
file in the include/scsi or drivers/scsi subdirectories

#+end_quote

*git whatchanged --since="2 weeks ago" -- gitk*

#+begin_quote
Show the changes during the last two weeks to the file /gitk/. The "--"
is necessary to avoid confusion with the *branch* named /gitk/

#+end_quote

* GIT
Part of the *git*(1) suite
