public/man/man1/git-whatchanged.1/index.html
<!DOCTYPE html>
<html
    lang="en-us"
    dir="ltr"
>
    <head>        <meta charset="utf-8">
<meta name="viewport" content="width=device-width,initial-scale=1">
<title>Manpages - git-whatchanged.1 | Technical Notes</title>

    <link rel="stylesheet" href="/css/main.css">


<link rel="stylesheet" href="/css/syntax.css">
        
        
    </head>
    <body>
        <header class="container header">
            <span class="header__title">Technical Notes</span>
<button id="menuOpenBtn" class="header__menu-open-btn"><i data-lucide="menu"></i></button>

  <nav id="siteNav">
    <ul>
    <li>
      <a href="/">Home</a>
    </li>
    <li>
      <a href="/notes/">Notes</a>
    </li>
    <li>
      <a aria-current="true" class="ancestor" href="/man/">Manpages</a>
    </li>
    <li>
      <a href="/search/">Search</a>
    </li>
    </ul>
    <button id="menuCloseBtn" class="header__menu-close-btn"><i data-lucide="x"></i></button>
  </nav>


        </header>
        <main class="container">
            
    <h1>Manpages - git-whatchanged.1</h1>
    
<div id="outline-container-headline-1" class="outline-2">
<h2 id="headline-1">
NAME
</h2>
<div id="outline-text-headline-1" class="outline-text-2">
<p>git-whatchanged - Show logs with differences each commit introduces</p>
</div>
</div>
<div id="outline-container-headline-2" class="outline-2">
<h2 id="headline-2">
SYNOPSIS
</h2>
<div id="outline-text-headline-2" class="outline-text-2">
<pre class="example">
git whatchanged &lt;option&gt;...
</pre>
</div>
</div>
<div id="outline-container-headline-3" class="outline-2">
<h2 id="headline-3">
DESCRIPTION
</h2>
<div id="outline-text-headline-3" class="outline-text-2">
<p>Shows commit logs and diff output each commit introduces.</p>
<p>
New users are encouraged to use <strong>git-log*(1) instead. The *whatchanged</strong>
command is essentially the same as *git-log*(1) but defaults to showing
the raw format diff output and skipping merges.</p>
<p>
The command is primarily kept for historical reasons; fingers of many
people who learned Git long before <strong>git log</strong> was invented by reading the
Linux kernel mailing list are trained to type it.</p>
</div>
</div>
<div id="outline-container-headline-4" class="outline-2">
<h2 id="headline-4">
EXAMPLES
</h2>
<div id="outline-text-headline-4" class="outline-text-2">
<p><strong>git whatchanged -p v2.6.12.. include/scsi drivers/scsi</strong></p>
<blockquote>
<p>Show as patches the commits since version <em>v2.6.12</em> that changed any
file in the include/scsi or drivers/scsi subdirectories</p>
</blockquote>
<p>
<strong>git whatchanged –since=&#34;2 weeks ago&#34; – gitk</strong></p>
<blockquote>
<p>Show the changes during the last two weeks to the file <em>gitk</em>. The &#34;–&#34;
is necessary to avoid confusion with the <strong>branch</strong> named <em>gitk</em></p>
</blockquote>
</div>
</div>
<div id="outline-container-headline-5" class="outline-2">
<h2 id="headline-5">
GIT
</h2>
<div id="outline-text-headline-5" class="outline-text-2">
<p>Part of the *git*(1) suite</p>
</div>
</div>


        </main>
        <footer class="container footer">
            <p>Copyright 2024. All rights reserved.</p>

        </footer>

        
        

        
            <script src="/js/main.js"></script>
    </body>
</html>
